const chat_apc='337277275';

var service = false;

const admins = ['337277275'];

const options = {
    attributeNamePrefix : "@_",
    attrNodeName: "attr", //default is 'false'
    textNodeName : "text",
    ignoreAttributes : true,
    ignoreNameSpace : false,
    allowBooleanAttributes : false,
    parseNodeValue : true,
    parseAttributeValue : false,
    trimValues: true,
    cdataTagName: "__cdata", //default is 'false'
    cdataPositionChar: "\\c",
    localeRange: "", //To support non english character in tag/attribute values.
    parseTrueNumberOnly: false
};

const users = {
    //ОЦТ
    "200487398": {"name": "Бурковская Елена Владимировна", "to":"Бурковск.+ Елен.+ Владимировн.+", "from": "Бурковская Е.В."},
    "144674173": {"name": "Винокуров Василий Дмитриевич", "to":"Винокуров.* Васили.+ Дмитриевич.*", "from": "Винокуров В.Д."},
    "500062077": {"name": "Герасимова Юлия Олеговна", "to":"Герасимов.+ Юли.+ Олеговн.+", "from": "Герасимова Ю.О."},
    "4": {"name": "Дьяконова Вилена Михайловна", "to":"Дьяконов.+ Вилен.+ Михайловн.+", "from": "Дьяконова В.М."},
    "948276462": {"name": "Ефремов Степан Иннокентьевич", "to":"Ефремов.* Степан.* Иннокентьевич.*", "from": "Ефремов С.И."},  
    "164571696": {"name": "Иванов Алексей Климентьевич", "to":"Иванов.* Алексе.+ Климентьевич.*", "from": "Иванов А.К."},
    "351070290": {"name": "Иванов Петр Гаврильевич", "to":"Иванов.* Петр.* Гаврильевич.*", "from": "Иванов П.Г."},
    "810717038": {"name": "Иванова Мария Владимировна", "to":"Иванов.+ Мари.+ Владимировн.+", "from": "Иванова М.В."},
    "9": {"name": "Иванова Татьяна Прокопьевна", "to":"Иванов.+ Татьян.+ Прокопьевн.+", "from": "Иванова Т.П."},
    "530692428": {"name": "Красильникова Елена Георгиевна", "to":"Красильников.+ Елен.+ Георгиевн.+", "from": "Красильникова Е.Г."},
    "244597033": {"name": "Карамзина Марина Анатольевна", "to":"Карамзин.+ Марин.+ Анатольевн.+", "from": "Карамзина М.А"},
    "11": {"name": "Мастеров Артур Яковлевич", "to":"Мастеров.* Артур.* Яковлевич.*", "from": "Мастеров А.Я."},
    "324416729": {"name": "Михайлов Сергей Гаврильевич", "to":"Михайлов.* Серге.+ Гаврильевич.*", "from": "Михайлов С.Г."},
    "13": {"name": "Павлов Алексей Юрьевич", "to":"Павлов.* Алексе.+ Юрьевич.*", "from": "Павлов А.Ю."},
    "324145269": {"name": "Попов Дмитрий Васильевич", "to":"Попов.* Дмитри.+ Васильевич.*", "from": "Попов Д.В."},
    "379077932": {"name": "Припузов Павел Сергеевич", "to":"Припузов.* Пав.+ Сергеевич.*", "from": "Припузов П.С."},
    "337277275": {"name": "Рудых Вадим Андреевич", "to":"Рудых.* Вадим.* Андреевич.*", "from": "Рудых В.А."},
    "1035080334": {"name": "Саввинова Анна Петровна", "to":"Саввинов.+ Анн.+ Петровн.+", "from": "Саввинова А.П."},
    "651299024": {"name": "Татаринов Андрей Кононович", "to":"Татаринов.* Андре.+ Кононович.*", "from": "Татаринов А.К."},
    "335241862": {"name": "Тихонов Сергей Вячеславович", "to":"Тихонов.* Серге.+ Вячеславович.*", "from": "Тихонов С.В."},
    "20": {"name": "Хорунова Сардана Николаевна", "to":"Хорунов.+ Сардан.+ Николаевн.+", "from": "Хорунова С.Н."}  
  };
  /*
  Бурковская Елена Владимировна
  Винокуров Василий Дмитриевич
  Герасимова Юлия Олеговна
  Дьяконова Вилена Михайловна
  Ефремов Степан Иннокентьевич
  Иванов Алексей Климентьевич
  Иванов Петр Гаврильевич
  Иванова Мария Владимировна
  Иванова Татьяна Прокопьевна
  Красильникова Елена Георгиевна
  Карамзина Марина Анатольевна
  Мастеров Артур Яковлевич
  Михайлов Сергей Гаврильевич
  Павлов Алексей Юрьевич
  Попов Дмитрий Васильевич
  Припузов Павел Сергеевич
  Рудых Вадим Андреевич
  Саввинова Анна Петровна
  Татаринов Андрей Кононович
  Тихонов Сергей Вячеславович
  Хорунова Сардана Николаевна
  */

 module.exports = {
    users: users,
    options: options,
    service: service,
    admins: admins,
    chat_apc: chat_apc
}